[
    {
        "title": "Removal and Replacement — 2012 Hyundai Sonata L4-2.4L Service Manual | Operation CHARM",
        "source_url": "https://charm.li/Hyundai/2012/Sonata%20L4-2.4L/Repair%20and%20Diagnosis/Engine%2C%20Cooling%20and%20Exhaust/Engine/Service%20and%20Repair/Removal%20and%20Replacement/",
        "category": "MANUAL",
        "original_context": "Removal and Replacement\nRemoval\nCAUTION:\n-\nUse fender covers to avoid damaging painted surfaces.\n-\nTo avoid damage, unplug the wiring connectors carefully while holding the connector portion.\nNOTE:\n-\nMark all wiring and hoses to avoid misconnection.\n-\nTo release the fuel system pressure before removing the engine assembly, start the engine with the fuel pump relay removed. And then turn off the ignition switch after engine stops.\n1.\nRemove the engine cover.\n2.\nDisconnect the battery terminals (A).\nTightening torque :\n(+) terminal : 7.8 - 9.8N.m (0.8 - 1.0kgf.m, 5.8 - 7.2lb-ft)\n(-) terminal : 4.0 - 6.0N.m (0.4 - 0.6kgf.m, 3.0 - 4.4lb-ft)\n3.\nRemove the air duct (B).\n4.\nRemove the battery (A) after removing the mounting bracket (B).\nTightening torque:\n9.8 - 11.8 N.m (1.0 - 1.2 kgf.m, 7.2 - 8.7 lb-ft)\n5.\nRemove the air cleaner assembly.\n(1)\nDisconnect the breather hose (A), the intensifier hose (B) and brake booster vacuum hose (C).\n(2)\nDisconnect the air intake hose (D) and then remove the air cleaner assembly (E).\nTightening torque\nHose clamp bolt:\n2.9 - 4.9N.m (0.3 - 0.5kgf.m, 2.2 - 3.6lb-ft)\nAir cleaner assembly bolts:\n7.8 - 9.8N.m (0.8 - 1.0kgf.m, 5.8 - 7.2lb-ft)\n6.\nRemove the battery tray (A).\nTightening torque:\n9.8 - 11.8 N.m (1.0 - 1.2 kgf.m, 7.2 - 8.7 lb-ft)\n7.\nRemove the under covers.\n8.\nLoosen the drain plug, and drain the engine coolant. Remove the radiator cap to drain with speed.\n9.\nDisconnect the radiator upper hose (A) and lower hose (B).\n10.\nRecover the refrigerant and then remove the high pressure pipe and low pressure pipe (A).\n11.\nDisconnect the (+) cable (A) from the fuse/relay box and the front connector (B). Then remove the wiring protector (C).\n12.\nDisconnect the ECM connectors (A) from the ECM, the fuse box connector (B) from the fuse/relay box and the engine ground line (C). Then remove the wiring protector (D).\n13.\nRemove the transaxle wire harness connectors (A) and control cable (B) from the transaxle. .\n14.\nDisconnect the ATF cooler hoses (A).\n15.\nDisconnect the heater hoses (A).\n16.\nDisconnect the fuel hose (A) and PCSV (Purge control solenoid valve) hose (B).\n17.\nRemove the front\nmuffler\n(B) after disconnecting the front oxygen sensor connector (A) (ULEV only).\nTightening torque:\n39.2 - 58.8 N.m (4.0 - 6.0 kgf.m, 28.9 - 43.4 lb-ft)\n18.\nRemove the steering u-joint mounting bolt (A).\n19.\nRemove the front wheels.\n20.\nRemove the lower arms (A).\n21.\nRemove the stabilizer bar links (A).\n22.\nRemove the tie rod ends (A).\n23.\nDisconnect the drive shafts from the axle hubs.\n24.\nSupport the sub frame (A) with a floor jack, and then remove the brackets (B) and the sub frame mounting bolts and nuts.\nTightening torque:\nSub frame mounting bolts & nuts :\n156.9 - 176.5 N.m (16.0 - 18.0 kgf.m, 115.7 - 130.2 lb-ft)\nBracket bolts :\n44.1 - 58.8 N.m (4.5 - 6.0 kgf.m, 32.5 - 43.4 lb-ft)\nNOTE:\n-\nAfter removing the sub frame mounting bolt, the engine and transaxle assembly may fall downward, and so support them securely with floor jack.\n-\nVerify that the hoses and connectors are disconnected before removing the engine and transaxle assembly.\n25.\nDisconnect the ground line (A), and then remove the engine mounting bracket (B).\nTightening torque:\n63.7 - 83.4 N.m (6.5 - 8.5 kgf.m, 47.0 - 61.5 lb-ft)\n26.\nDisconnect the ground line (A), and then remove the transaxle mounting bracket through bolt (B).\nTightening torque:\n68.6 - 93.2 N.m (7.0 - 9.5 kgf.m, 50.6 - 68.7 lb-ft)\n27.\nRemove the engine and transaxle assembly by lifting vehicle.\nCAUTION:\nWhen remove the engine and transaxle assembly, be careful not to damage any surrounding parts or body components.\nInstallation\nInstallation is in the reverse order of removal.\nPerform the following :\n-\nAdjust a shift cable.\n-\nRefill engine with engine oil.\n-\nRefill a transaxle with fluid.\n-\nRefill a radiator and a reservoir tank with engine coolant.\n-\nClean battery posts and cable terminals and assemble.\n-\nInspect for fuel leakage.\n-\nAfter assemble the fuel line, turn on the ignition switch (do not operate the starter) so that the fuel pump runs for approximately two seconds and fuel line pressurizes.\n-\nRepeat this operation two or three times, then check for fuel leakage at any point in the fuel line.\n-\nBleed air from the\ncooling system\n.\n-\nStart engine and let it run until it warms up. (until the radiator fan operates 3 or 4 times.)\n-\nTurn Off the engine. Check the level in the radiator, add coolant if needed. This will allow trapped air to be removed from the\ncooling system\n.\n-\nPut radiator cap on tightly, then run the engine again and check for leaks.",
        "extracted_at": "2026-01-12 14:46:10"
    }
]