[
    {
        "id": 1,
        "name": "Spicy",
        "content": "후추나 시나몬 같은 향신료에서 느껴지는 따뜻하고 자극적인 향. 강렬하면서도 대담한 느낌으로, 어두운 조명 아래 와인 한 잔을 즐기는 우아한 저녁 모임에 어울립니다. 따뜻한 니트나 가죽 재킷과도 잘 어울리는 계열입니다.",
        "description": "자극적이며 섹시한 향",
        "color": "FF5757"
    },
    {
        "id": 2,
        "name": "Fruity",
        "content": "잘 익은 과일의 달콤함과 상큼함이 조화를 이루는 향. 햇살이 비치는 공원에서 피크닉을 즐기거나, 친구들과 가벼운 브런치를 즐길 때 어울립니다. 발랄하고 사랑스러운 이미지를 연출하는 데 적합합니다.",
        "description": "달콤하고 귀여운 향",
        "color": "FFBD43"
    },
    {
        "id": 3,
        "name": "Citrus",
        "content": "갓 짜낸 오렌지 주스처럼 톡 쏘는 상쾌함과 신선함을 주는 향. 무더운 여름날 시원한 레모네이드를 마시는 순간이나, 활기찬 아침 출근길에 어울립니다. 에너지를 북돋아 주는 활력의 계열입니다.",
        "description": "과일 같은 상큼한 향",
        "color": "FFE043"
    },
    {
        "id": 4,
        "name": "Green",
        "content": "비 온 뒤 숲속의 맑은 공기나, 잘 정돈된 잔디밭 위의 신선함을 담은 향. 여유로운 산책이나 차분한 독서 시간과 잘 어울리며, 자연 속에 있는 듯한 평온함을 줍니다.",
        "description": "상쾌하고 신선한 향",
        "color": "62D66A"
    },
    {
        "id": 5,
        "name": "Aldehyde",
        "content": "고급스러운 비누향과 깨끗함이 돋보이는 향. 깔끔한 화이트 셔츠나 포멀한 정장 차림에 잘 어울리며, 모던하고 세련된 이미지를 강조합니다. 회의실에서의 자신감 넘치는 프레젠테이션이나, 갤러리 방문 같은 정적인 분위기에 적합합니다.",
        "description": "인공 비누향, 모던하고 우아하면 지적인 향",
        "color": "98D1FF"
    },
    {
        "id": 6,
        "name": "Aquatic",
        "content": "시원한 바닷바람과 맑은 물방울을 연상시키는 청량한 향. 해변에서 여름 바캉스를 즐기거나, 수영장에서 느껴지는 잔잔한 물결의 고요함을 담았습니다. 더운 날의 피로를 씻어내는 상쾌함을 제공합니다.",
        "description": "들과 바다 시원함이 가득한 향",
        "color": "56D2FF"
    },
    {
        "id": 7,
        "name": "Fougere",
        "content": "부드럽고 편안한 느낌을 주는 라벤더와 오크모스의 조화로운 향. 클래식한 이탈리안 정원에서 느껴지는 고급스러운 감성과 여유로움을 떠올리게 합니다. 남성적인 매력을 부드럽게 표현할 때 적합합니다.",
        "description": "부드럽고 감미로우며 편안한 향",
        "color": "7ED3BB"
    },
    {
        "id": 8,
        "name": "Gourmand",
        "content": "따뜻한 초콜릿 케이크나 갓 구운 쿠키처럼 달콤하고 유혹적인 향. 디저트 카페에서 느낄 수 있는 포근한 향기로, 사랑스럽고 다정한 이미지를 연출합니다. 겨울 저녁에 특히 잘 어울리는 계열입니다.",
        "description": "달달하고 유혹적인 미각의 즐거움을 느낄 수 있는 향",
        "color": "A1522C"
    },
    {
        "id": 9,
        "name": "Woody",
        "content": "나무의 따뜻함과 자연스러운 우아함이 느껴지는 향. 모닥불 옆에서 느껴지는 평온함과, 빈티지 가구에서 풍기는 고급스러운 분위기를 연상시킵니다. 클래식한 스타일을 선호하는 이들에게 추천합니다.",
        "description": "고상하고 증후한 느낌의 따뜻하고 부드러운 향",
        "color": "86390F"
    },
    {
        "id": 10,
        "name": "Oriental",
        "content": "달콤하고 부드러운 바닐라와 고혹적인 앰버가 어우러져 센슈얼한 매력을 발산하는 향. 붉은 실크 드레스나 황혼의 무드에 어울리며, 이국적이고 매혹적인 분위기를 만들어냅니다.",
        "description": "무거우면서 부드럽고 고혹적인 향, 증후하고 달콤하며 센슈얼한 향",
        "color": "C061FF"
    },
    {
        "id": 11,
        "name": "Floral",
        "content": "화사한 꽃다발처럼 우아하고 여성스러운 향. 봄날 벚꽃 아래를 걷는 듯한 로맨틱한 분위기를 만들어주며, 부드러운 드레스 차림에 잘 어울립니다.",
        "description": "화려하고 여성스러운 향",
        "color": "FF80C1"
    },
    {
        "id": 12,
        "name": "Musk",
        "content": "따뜻하면서도 부드럽게 이성을 자극하는 매혹적인 향. 깨끗하고 포근한 머스크의 베이스는, 자연스러운 아름다움을 강조하는 분위기를 연출합니다. 특별한 데이트나 은밀한 저녁 시간에 적합합니다.",
        "description": "이성에게 어필 가능한 아름다운 향",
        "color": "F8E4FF"
    },
    {
        "id": 13,
        "name": "Powdery",
        "content": "포근한 담요처럼 감싸주는 부드럽고 따뜻한 향. 차분하고 편안한 분위기를 연출하며, 휴식이 필요한 공간이나 밤 시간에 잘 어울립니다.",
        "description": "포근한 향",
        "color": "FFFFFF"
    },
    {
        "id": 14,
        "name": "Tobacco Leather",
        "content": "스모키한 담배와 묵직한 가죽 향이 어우러져 강렬한 남성미를 느낄 수 있는 향. 한겨울 가죽 재킷을 입고 있는 도시 남성의 세련된 매력을 연상시킵니다. 중성적이면서도 고급스러운 분위기를 연출합니다.",
        "description": "마초적인 남성의 개성이 강한 매력적인 향",
        "color": "000000"
    }
]